39.1. Напишите функцию rmodd, которая получает на вход список, и выдаёт список, в который входят значения входного списка на нечётных позициях (первая позиция в списке, с индексом 0, считается чётной).

39.2. Напишите функцию del_even, которая получает на вход список, и выдаёт список, из которого удалены все чётные значения входного списка.

39.3. Напишите функцию multiplicity x xs, которая находит, сколько раз значение x встречается в списке xs.

39.4. Напишите функцию split, которая разделяет входной список на два следующим образом:


split [x1; x2; ...; xn-1; xn] = ([x1; x3; ...], [x2; x4; ...])
39.5. Напишите функцию zip, которая преобразует два входных списка в результирующий список следующим образом:

zip ([x1; x2; ...], [y1; y2; ...]) = [(x1,y1); (x2,y2); ...]
Если длины входных списков неодинаковы, генерируйте исключение.


// 39.1
let rec rmodd = ...

// 39.2
let rec del_even = ...

// 39.3
let rec multiplicity x xs = ...

// 39.4
let rec split = ...

// 39.5
let rec zip (xs1,xs2) = ...
