47.4.1. Напишите функцию факториала f: int -> int, не используя рекурсию, с помощью императивных возможностей.

47.4.2. Напишите функцию fibo: int -> int, где fibo(n) вычисляет n-е число Фибоначчи (n >= 0), не используя рекурсию, с помощью императивных возможностей.
Последовательность Фибоначчи начинается с двух значений 0,1, а n-й элемент равен сумме n-1 - го и n-2 - го элементов: 0,1,1,2,3,5,8,13,...

// 47.4.1
let f n =
    let mutable result = 1
    let mutable i = 1

    while i <= n do
        result <- result * i
        i <- i + 1

    result

// 47.4.2
let fibo n =
    let mutable a = 0
    let mutable b = 1

    for _ in 1 .. n do
        let next = a + b
        a <- b
        b <- next

    a
